In [2]:
import pandas as pd
import numpy as np

In [5]:
MySeries = pd.Series(data=np.random.randint(1,10,4), index='A B C D'.split())

In [6]:
MySeries

A    5
B    8
C    4
D    3
dtype: int32

In [10]:
MySeries['A']

5

In [12]:
d = {'A':5, 'B':8, 'C':4, 'D':3}

In [13]:
pd.Series(d)

A    5
B    8
C    4
D    3
dtype: int64

In [15]:
pd.Series(data=np.random.randint(1,10,4))

0    8
1    6
2    4
3    4
dtype: int32

In [17]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [18]:
data = np.random.randint(1,10,4)
index = 'A B C D'.split()
pd.Series(data=data, index=index)

A    7
B    5
C    7
D    3
dtype: int32

In [23]:
s1 = pd.Series([1,2,3,4], 'A B C D'.split())

In [24]:
s2 = pd.Series([10,20,30,40], 'A B C E'.split())

In [25]:
s1+s2

A    11.0
B    22.0
C    33.0
D     NaN
E     NaN
dtype: float64

# DataFrame

In [30]:
df = pd.DataFrame(data=np.random.randn(5,4),
                  index='1 2 3 4 5'.split(), 
                  columns='W X Y Z'.split())

In [31]:
df

          W         X         Y         Z
1  1.884712 -0.195559  1.009948  0.342669
2  0.197098 -2.247749 -0.621816  0.830135
3  0.563696 -0.654485  1.662412 -1.442379
4 -2.322036 -0.176695  0.826141 -0.380281
5 -0.091297 -1.041440 -2.255721  0.455155

In [33]:
df.Z

1    0.342669
2    0.830135
3   -1.442379
4   -0.380281
5    0.455155
Name: Z, dtype: float64

In [34]:
df['W']

1    1.884712
2    0.197098
3    0.563696
4   -2.322036
5   -0.091297
Name: W, dtype: float64

In [35]:
df.loc['1']

W    1.884712
X   -0.195559
Y    1.009948
Z    0.342669
Name: 1, dtype: float64

In [38]:
df[['W','Z']]

          W         Z
1  1.884712  0.342669
2  0.197098  0.830135
3  0.563696 -1.442379
4 -2.322036 -0.380281
5 -0.091297  0.455155

In [40]:
df.loc[['1','2']]

          W         X         Y         Z
1  1.884712 -0.195559  1.009948  0.342669
2  0.197098 -2.247749 -0.621816  0.830135

In [41]:
df.loc['1','Y']

1.009948261670647

In [42]:
df.loc[['1','2'],['W','Z']]

          W         Z
1  1.884712  0.342669
2  0.197098  0.830135

In [54]:
df['havij'] = df['W']+df['Y']

In [55]:
df

          W         X         Y         Z       W+Y     havij
1  1.884712 -0.195559  1.009948  0.342669  2.894660  2.894660
2  0.197098 -2.247749 -0.621816  0.830135 -0.424718 -0.424718
3  0.563696 -0.654485  1.662412 -1.442379  2.226109  2.226109
4 -2.322036 -0.176695  0.826141 -0.380281 -1.495895 -1.495895
5 -0.091297 -1.041440 -2.255721  0.455155 -2.347018 -2.347018

In [59]:
df2 = pd.DataFrame()

In [63]:
df2['W'] = df['W+Y']

In [64]:
df2

          W
1  2.894660
2 -0.424718
3  2.226109
4 -1.495895
5 -2.347018

In [67]:
type(df['W'])

pandas.core.series.Series

In [73]:
df.drop('4',axis=0, inplace= True)

In [74]:
df

          W         X         Y         Z     havij
1  1.884712 -0.195559  1.009948  0.342669  2.894660
2  0.197098 -2.247749 -0.621816  0.830135 -0.424718
3  0.563696 -0.654485  1.662412 -1.442379  2.226109
5 -0.091297 -1.041440 -2.255721  0.455155 -2.347018

In [76]:
df.reset_index()

  index         W         X         Y         Z     havij
0     1  1.884712 -0.195559  1.009948  0.342669  2.894660
1     2  0.197098 -2.247749 -0.621816  0.830135 -0.424718
2     3  0.563696 -0.654485  1.662412 -1.442379  2.226109
3     5 -0.091297 -1.041440 -2.255721  0.455155 -2.347018

In [77]:
df

          W         X         Y         Z     havij
1  1.884712 -0.195559  1.009948  0.342669  2.894660
2  0.197098 -2.247749 -0.621816  0.830135 -0.424718
3  0.563696 -0.654485  1.662412 -1.442379  2.226109
5 -0.091297 -1.041440 -2.255721  0.455155 -2.347018

In [78]:
df['Province'] = 'ZAH TAB TEH ILAM'.split()

In [79]:
df

          W         X         Y         Z     havij Province
1  1.884712 -0.195559  1.009948  0.342669  2.894660      ZAH
2  0.197098 -2.247749 -0.621816  0.830135 -0.424718      TAB
3  0.563696 -0.654485  1.662412 -1.442379  2.226109      TEH
5 -0.091297 -1.041440 -2.255721  0.455155 -2.347018     ILAM

In [82]:
df.set_index('Province', inplace = True)

In [83]:
df

                 W         X         Y         Z     havij
Province
ZAH       1.884712 -0.195559  1.009948  0.342669  2.894660
TAB       0.197098 -2.247749 -0.621816  0.830135 -0.424718
TEH       0.563696 -0.654485  1.662412 -1.442379  2.226109
ILAM     -0.091297 -1.041440 -2.255721  0.455155 -2.347018

In [84]:
df3 = pd.DataFrame(data=np.random.randn(5000,4), 
                  columns='W X Y Z'.split())

In [85]:
df3

             W         X         Y         Z
0     1.951820  0.884818 -0.066318 -0.341941
1     0.970668 -0.029254 -0.710123 -1.170993
2     0.316875 -0.889081  0.225730  1.341110
3     1.578814  0.002359 -0.987821  0.810060
4    -0.663500  0.269693 -0.764222  0.906476
...        ...       ...       ...       ...
4995 -1.277113 -1.345552 -0.422823  0.045783
4996  1.391093  0.421391  0.493331  0.419726
4997 -0.073517 -0.246885 -0.807430 -1.818423
4998  1.120727 -0.334780 -0.757238 -0.026039
4999  1.454675  0.497425 -1.122799 -1.029638

[5000 rows x 4 columns]

In [96]:
df3.describe()

                 W            X            Y            Z
count  5000.000000  5000.000000  5000.000000  5000.000000
mean     -0.017926    -0.001746    -0.017245    -0.007203
std       0.995559     1.007159     0.997976     1.000901
min      -3.708977    -3.891639    -3.442399    -3.868390
25%      -0.688412    -0.681277    -0.677765    -0.694116
50%      -0.022344     0.013918    -0.030041     0.001898
75%       0.662785     0.676531     0.648822     0.657502
max       3.387787     4.181118     3.736008     4.052621

In [97]:
df3.keys()

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [99]:
df3.shape

(5000, 4)

In [107]:
d = {'A':['A1','A2','A3'], 'B':['B1','B2','B3']}
dd = {'A':['AA1','AA2','AA3'], 'B':['BB1','BB2','BB3']}

In [127]:
f = pd.DataFrame(d, index=[0, 1, 2])

In [128]:
ff = pd.DataFrame(dd, index=[0, 1, 2])

In [129]:
f

    A   B
0  A1  B1
1  A2  B2
2  A3  B3

In [130]:
ff

     A    B
0  AA1  BB1
1  AA2  BB2
2  AA3  BB3

In [131]:
pd.concat([f,ff], axis=1)

    A   B    A    B
0  A1  B1  AA1  BB1
1  A2  B2  AA2  BB2
2  A3  B3  AA3  BB3

# Masking

In [132]:
df

                 W         X         Y         Z     havij
Province
ZAH       1.884712 -0.195559  1.009948  0.342669  2.894660
TAB       0.197098 -2.247749 -0.621816  0.830135 -0.424718
TEH       0.563696 -0.654485  1.662412 -1.442379  2.226109
ILAM     -0.091297 -1.041440 -2.255721  0.455155 -2.347018

In [134]:
df[df>0]

                 W   X         Y         Z     havij
Province
ZAH       1.884712 NaN  1.009948  0.342669  2.894660
TAB       0.197098 NaN       NaN  0.830135       NaN
TEH       0.563696 NaN  1.662412       NaN  2.226109
ILAM           NaN NaN       NaN  0.455155       NaN

In [137]:
df['W'][df['W']>0]

Province
ZAH    1.884712
TAB    0.197098
TEH    0.563696
Name: W, dtype: float64

In [138]:
df[df['W']>0]

                 W         X         Y         Z     havij
Province
ZAH       1.884712 -0.195559  1.009948  0.342669  2.894660
TAB       0.197098 -2.247749 -0.621816  0.830135 -0.424718
TEH       0.563696 -0.654485  1.662412 -1.442379  2.226109

In [140]:
df[(df['W']>0) & (df['Y']>0)]

                 W         X         Y         Z     havij
Province
ZAH       1.884712 -0.195559  1.009948  0.342669  2.894660
TEH       0.563696 -0.654485  1.662412 -1.442379  2.226109

# Missing Values

In [142]:
np.nan == np.nan

True

In [148]:
np.isnan(np.nan)

True

In [146]:
float('nan')

nan

In [149]:
pd.isnull(np.nan)

True

In [176]:
df = pd.DataFrame({'A':[1,np.nan, 2],
                  'B':[5,np.nan, np.NaN],
                  'C':[1,2,40]})

In [151]:
df

     A    B   C
0  1.0  5.0   1
1  2.0  NaN   2
2  NaN  NaN  40

In [154]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [153]:
df.dropna(axis=1)

    C
0   1
1   2
2  40

In [168]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [170]:
df.fillna(value='Nan sabegh')

            A           B   C
0           1           5   1
1           2  Nan sabegh   2
2  Nan sabegh  Nan sabegh  40

In [171]:
df

     A    B   C
0  1.0  5.0   1
1  2.0  NaN   2
2  NaN  NaN  40

In [173]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [174]:
df.fillna(method='ffill')

     A    B   C
0  1.0  5.0   1
1  2.0  5.0   2
2  2.0  5.0  40

In [179]:
df.fillna(method='bfill')

     A    B   C
0  1.0  5.0   1
1  2.0  NaN   2
2  2.0  NaN  40

In [178]:
df

     A    B   C
0  1.0  5.0   1
1  NaN  NaN   2
2  2.0  NaN  40

# Group By

In [184]:
df_dict = {'Sim':['Irancell','Irancell','HA','HA','Talia','Talia'],
       'User':['Rezae','Karimi','Jafari','Bahrami','Tabrizi','Amini'],
       'Fee':[30,12,74,24,124,43]}

In [185]:
df = pd.DataFrame(df_dict)

In [186]:
df

        Sim     User  Fee
0  Irancell    Rezae   30
1  Irancell   Karimi   12
2        HA   Jafari   74
3        HA  Bahrami   24
4     Talia  Tabrizi  124
5     Talia    Amini   43

In [188]:
simGroup = df.groupby('Sim')

In [189]:
simGroup.mean()

           Fee
Sim
HA        49.0
Irancell  21.0
Talia     83.5

In [190]:
simGroup.std()

                Fee
Sim
HA        35.355339
Irancell  12.727922
Talia     57.275649

In [191]:
simGroup.count()

          User  Fee
Sim
HA           2    2
Irancell     2    2
Talia        2    2

In [192]:
simGroup.describe()

           Fee
         count  mean        std   min    25%   50%     75%    max
Sim
HA         2.0  49.0  35.355339  24.0  36.50  49.0   61.50   74.0
Irancell   2.0  21.0  12.727922  12.0  16.50  21.0   25.50   30.0
Talia      2.0  83.5  57.275649  43.0  63.25  83.5  103.75  124.0

In [193]:
df

        Sim     User  Fee
0  Irancell    Rezae   30
1  Irancell   Karimi   12
2        HA   Jafari   74
3        HA  Bahrami   24
4     Talia  Tabrizi  124
5     Talia    Amini   43

In [201]:
res = []
for i in df['User'].values:
    res.append(i.lower())

In [202]:
res

['rezae', 'karimi', 'jafari', 'bahrami', 'tabrizi', 'amini']

In [210]:
df['Fee'].values.astype(np.int64)

array([ 30,  12,  74,  24, 124,  43], dtype=int64)

In [211]:
df['user'] = res

In [212]:
df

        Sim     User  Fee     user
0  Irancell    Rezae   30    rezae
1  Irancell   Karimi   12   karimi
2        HA   Jafari   74   jafari
3        HA  Bahrami   24  bahrami
4     Talia  Tabrizi  124  tabrizi
5     Talia    Amini   43    amini

In [213]:
def mylower_case(mstr):
    return mstr.lower()

In [214]:
mylower_case('Rezae')

'rezae'

In [222]:
df['User'] = df['User'].apply(lambda x:x.upper())

In [223]:
df

        Sim     User  Fee     user
0  Irancell    REZAE   30    rezae
1  Irancell   KARIMI   12   karimi
2        HA   JAFARI   74   jafari
3        HA  BAHRAMI   24  bahrami
4     Talia  TABRIZI  124  tabrizi
5     Talia    AMINI   43    amini

df

In [224]:
df

        Sim     User  Fee     user
0  Irancell    REZAE   30    rezae
1  Irancell   KARIMI   12   karimi
2        HA   JAFARI   74   jafari
3        HA  BAHRAMI   24  bahrami
4     Talia  TABRIZI  124  tabrizi
5     Talia    AMINI   43    amini

In [225]:
df.to_csv("example.csv")

In [238]:
df = pd.read_csv("example.csv", header=None)

In [239]:
df

   0         1        2    3        4
0  0  Irancell    REZAE   30    rezae
1  1  Irancell   KARIMI   12   karimi
2  2        HA   JAFARI   74   jafari
3  3        HA  BAHRAMI   24  bahrami
4  4     Talia  TABRIZI  124  tabrizi
5  5     Talia    AMINI   43    amini

In [241]:
df.columns = 'chert W Q A S'.split()

In [242]:
df

   chert         W        Q    A        S
0      0  Irancell    REZAE   30    rezae
1      1  Irancell   KARIMI   12   karimi
2      2        HA   JAFARI   74   jafari
3      3        HA  BAHRAMI   24  bahrami
4      4     Talia  TABRIZI  124  tabrizi
5      5     Talia    AMINI   43    amini

In [245]:
df.to_excel('Ex1.xlsx',sheet_name="sad" )

In [248]:
pd.read_excel('Ex1.xlsx' )

   Unnamed: 0  chert         W        Q    A        S
0           0      0  Irancell    REZAE   30    rezae
1           1      1  Irancell   KARIMI   12   karimi
2           2      2        HA   JAFARI   74   jafari
3           3      3        HA  BAHRAMI   24  bahrami
4           4      4     Talia  TABRIZI  124  tabrizi
5           5      5     Talia    AMINI   43    amini

In [250]:
a = pd.read_html('https://www.imdb.com/title/tt8092118/fullcredits/?ref_=tt_ov_st_sm')

In [251]:
type(a)

list

In [252]:
len(a)

5

In [253]:
a[0]

               0   1   2
0  Tomonori SudÃ´ NaN NaN

In [254]:
a[1]

             0    1          2
0  Kinoko Nasu  ...  (creator)

In [255]:
a[2]

    0                 1    2                                3
0 NaN               NaN  NaN                              NaN
1 NaN        Yu Asakawa  ...                    Rider (voice)
2 NaN      Mai Kadowaki  ...  Illyasviel von Einzbern (voice)
3 NaN       JÃ´ji Nakata  ...           Kirei Kotomine (voice)
4 NaN   Tadahisa Saizen  ...                Berserker (voice)
5 NaN    Noriko Shitaya  ...             Sakura Matou (voice)
6 NaN  Noriaki Sugiyama  ...             Shirou Emiya (voice)
7 NaN         Kana Ueda  ...              Rin Tohsaka (voice)